/*************************Copy Right(c)********************************************
**         HFR(HuaZhong University of science and technology ) MIB.HFR

**-------------------------------------File Info-------------------------------------
**File Name :						   LEswitch.c
**Created By:                          TangNan
**Created Data:						  2011.8.16
**Description;			              光电开关读取程序       	
************************************************************************************/
#include"Config.h"
#include"LEswitch.h"

/*********************初始化外部中断*************************/
void InitINIT0()
{
 INT0 = 1;
 EX0 = 1;					   //开启外部中断
 IT0 = 0;					   //电平检测
}
/**************************中断处理****************************/
void INIT0_isr() interrupt 0
{
 StopCar();
 while(!INT0);
}
/*****************************************************************
****        End of file 
******************************************************************/
