/*************************Copy Right(c)********************************************
**         HFR(HuaZhong University of science and technology ) MIB.HFR

**-------------------------------------File Info-------------------------------------
**File Name :						   LEswitch.c
**Created By:                          TangNan
**Created Data:						  2011.8.16
**Description;			              开关检测       	
************************************************************************************/
#include"Config.h"

/*---------------------------------------------------------------------------------------
***Function Name:             	  GetSwitchStatus
***Value:    				      NONE
***Return:                        SwitchStatus
***Description:                  左右电机一起输出
---------------------------------------------------------------------------------------*/
INT8U GetSwitchStatus()
{
	 INT8U SwitchStatus;
	 SwitchStatus = SwitchPORT&0x0f;
	 return SwitchStatus;
}

/*---------------------------------------------------------------------------------------
***Function Name:             	  InitINT0
***Value:    				      NONE
***Return:                        NONE
***Description:                  初始化外部中断0
---------------------------------------------------------------------------------------*/
void InitINT0()
{
 	INT0 = 1;
 	EX0 = 1;					   //开启外部中断
 	IT0 = 0;					   //电平检测
}
/*---------------------------------------------------------------------------------------
***Function Name:             	  INIT0_ISR
***Value:    				      NONE
***Return:                        NONE
***Description:                   外部中断0
---------------------------------------------------------------------------------------*/
void INT0_ISR() interrupt 0
{
	StopCar();
 	while(!INT0);
}
/****************************************************************************************
****        End of file 
******************************************************************************************/
